{
  "accessibility": {
    "title": "Datganiad Hygyrchedd ar gyfer Addasiadau Rhesymol",
    "section1": "  <p class=\"govuk-body-m\">Gwasanaeth Llysoedd a Thribiwnlysoedd EF sy’n gyfrifol am y wefan hon, ac rydym eisiau i gymaint o bobl â phosibl allu ei defnyddio. Er enghraifft, golyga hyn y dylech allu:</p>\n  <ul class=\"govuk-list govuk-list--bullet\">\n    <li>newid y lliwiau, y lefelau cyferbyniad a’r ffontiau</li>\n    <li>gwneud y testun hyd at 300% yn fwy heb iddo ddiflannu oddi ar y sgrin</li>\n    <li>mynd drwy'r rhan fwyaf o'r wefan gan ddefnyddio bysellfwrdd yn unig</li>\n    <li>mynd drwy'r rhan fwyaf o'r wefan gan ddefnyddio meddalwedd adnabod llais</li>\n    <li>gwrando ar y rhan fwyaf o'r wefan gan ddefnyddio darllenydd sgrin (gan gynnwys fersiynau diweddaraf JAWS, NVDA a VoiceOver)</li>\n  </ul>\n  <p class=\"govuk-body-m\">Rydym hefyd wedi sicrhau ein bod wedi defnyddio iaith syml ar y wefan.</p>\n  <p class=\"govuk-body-m\">Mae gan <a href=\"https://mcmw.abilitynet.org.uk/\">AbilityNet</a> gyngor ynghylch gwneud eich dyfais yn haws i’w defnyddio os oes gennych anabledd.</p>",
    "section2": "  <h2 class=\"govuk-heading-l\">Adborth a gwybodaeth gyswllt</h2>\n  <p class=\"govuk-body-m\">We provide a text relay service for people who are deaf, hearing impaired or have a speech impediment.Os ydych angen gwybodaeth sydd ar y wefan hon mewn fformat arall megis ar ffurf PDF hygyrch, print bras, fformat hawdd ei ddeall, recordiad sain neu braille:</p>\n  <ul class=\"govuk-list govuk-list--bullet\">\n    <li>e-bostiwch <a class=\"govuk-link\" href=\"mailto:C100applications@justice.gov.uk\">C100applications@justice.gov.uk</a></li>\n  </ul><p class=\"govuk-body-m\">We’re always looking to improve the accessibility of this website. If you find any problems that are not listed on this page or think we’re not meeting accessibility requirements please contact us on our email C100applications@justice.gov.uk. </p>\n",
    "section4": "  <h2 class=\"govuk-heading-l\">Y Weithdrefn Orfodi</h2>\n  <p class=\"govuk-body-m\">Y Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) sy’n gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018 (y ‘rheoliadau hygyrchedd’). Os nad ydych chi’n fodlon gyda’r ffordd rydym yn ymateb i’ch cwyn, <a href=\"https://eass-ws.custhelp.com/app/home\">cysylltwch â’r Gwasanaeth Cynghori a Chymorth Cydraddoldeb (EASS)</a>.</p>",
    "section5": "  <h2 class=\"govuk-heading-l\">Gwybodaeth dechnegol am hygyrchedd y wefan hon</h2>\n  <p class=\"govuk-body-m\">Mae GLlTEF wedi ymrwymo i sicrhau bod ei wefannau yn hygyrch, a hynny yn unol â Rheoliadau Hygyrchedd Cyrff y Sector Gyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018.</p>",
    "section6": "  <h2 class=\"govuk-heading-l\">Statws cydymffurfiaeth</h2>\n  <p class=\"govuk-body-m\"> Mae’r wefan hon yn cydymffurfio’n rhannol â safon AA <a href=\"https://www.w3.org/TR/WCAG22/\">Canllawiau Hygyrchedd Cynnwys Gwe fersiwn 2.2</a> a hynny oherwydd yr enghreifftiau o beidio â chydymffurfio a restrir isod.</p>\n",
    "section7": "  <h2 class=\"govuk-heading-l\">Cynnwys anhygyrch</h2>\n  <p class=\"govuk-body-m\">Mae’r cynnwys a restrir isod yn anhygyrch am y rhesymau canlynol:</p>\n  <ul class=\"govuk-list govuk-list--bullet\">\n <h3 class=\"govuk-heading-s\">Anghydymffurfio â’r rheoliadau hygyrchedd</h3>\n <ul class=\"govuk-list govuk-list--bullet\">\n <li>Efallai y bydd rhai dolenni yn ymddangos yn y ddewislen 'landmarks' yn y rotor VoiceOver. Mae hyn yn golygu y gall defnyddwyr darllenydd sgrin brofi rhywfaint o ddryswch wrth lywio gan ddefnyddio'r rotor. Mae hyn yn methu meini prawf WCAG 2.2: 2.4.4 Pwrpas Dolen (Mewn Cyd-destun) a 4.1.2 Enw, Rôl, Gwerth.</li>\n<li>Rydym wedi adolygu'r mater hwn ac, gan ei fod yn fater o flaenoriaeth is ac yn rhan o gynllunio llyfrgell govuk-header, byddwn yn codi hyn yn uniongyrchol gyda thîm GDS a monitro tan y caiff y mater ei ddatrys.</li>\n</ul>\n</ul>\n",
    "section8": "  <h2 class=\"govuk-heading-l\">What we’re doing to improve accessibility</h2>\n  <p class=\"govuk-body-m\">This website is continually tested using accessibility automated tests and basic manual and assistive technology checks. Any new features which are introduced will also be tested internally or with the support of the internal HMCTS accessibility testing team.</p>\n",
    "section9": "  <h2 class=\"govuk-heading-l\">Paratoi’r datganiad hygyrchedd hwn</h2>\n  <p class=\"govuk-body-m\">Cafodd y datganiad hwn ei baratoi ar 1st Feb 2025. Fe’i diweddarwyd diwethaf ar 30th July 2025.</p>\n  <p class=\"govuk-body-m\">Profwyd y wefan hon ddiwethaf ar 17 Ebrill 2025. he audit was carried out by the internal HMCTS accessibility testing team. The team tested against a range of assistive technologies and accessibility testing tools.</p>"
  }
}
